/*
 * @lc app=leetcode.cn id=36 lang=javascript
 * @lcpr version=30300
 *
 * [36] 有效的数独
 */

import { ListNode } from "../common/listNode.js";
import { TreeNode } from "../common/treeNode.js";

// @lc code=start
/**
 * v1 模拟
 * @param {character[][]} board
 * @return {boolean}
 */
const isValidSudoku = function (board) {
  // 统计每行每列和每个小方格中数组出现的次数
  const rows = Array.from({ length: 9 }, () => new Array(9).fill(0));
  const cols = Array.from({ length: 9 }, () => new Array(9).fill(0));
  const boxes = Array.from({ length: 9 }, () => new Array(9).fill(0));

  for (let i = 0; i < 9; i++) {
    for (let j = 0; j < 9; j++) {
      const c = board[i][j];
      if (c !== ".") {
        const index = parseInt(c) - 1;
        rows[i][index]++;
        cols[j][index]++;
        // 根据二位坐标，计算小方格的索引
        const boxIndex = Math.floor(i / 3) * 3 + Math.floor(j / 3);
        boxes[boxIndex][index]++;
        if (
          rows[i][index] > 1 ||
          cols[j][index] > 1 ||
          boxes[boxIndex][index] > 1
        )
          return false;
      }
    }
  }
  return true;
};
// @lc code=end

// your test code here
isValidSudoku([
  ["8", "3", ".", ".", "7", ".", ".", ".", "."],
  ["6", ".", ".", "1", "9", "5", ".", ".", "."],
  [".", "9", "8", ".", ".", ".", ".", "6", "."],
  ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
  ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
  ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
  [".", "6", ".", ".", ".", ".", "2", "8", "."],
  [".", ".", ".", "4", "1", "9", ".", ".", "5"],
  [".", ".", ".", ".", "8", ".", ".", "7", "9"],
]);
/*
// @lcpr case=start
// \n[["5","3",".",".","7",".",".",".","."]\n,["6",".",".","1","9","5",".",".","."]\n,[".","9","8",".",".",".",".","6","."]\n,["8",".",".",".","6",".",".",".","3"]\n,["4",".",".","8",".","3",".",".","1"]\n,["7",".",".",".","2",".",".",".","6"]\n,[".","6",".",".",".",".","2","8","."]\n,[".",".",".","4","1","9",".",".","5"]\n,[".",".",".",".","8",".",".","7","9"]]\n
// @lcpr case=end

// @lcpr case=start
// \n[["8","3",".",".","7",".",".",".","."]\n,["6",".",".","1","9","5",".",".","."]\n,[".","9","8",".",".",".",".","6","."]\n,["8",".",".",".","6",".",".",".","3"]\n,["4",".",".","8",".","3",".",".","1"]\n,["7",".",".",".","2",".",".",".","6"]\n,[".","6",".",".",".",".","2","8","."]\n,[".",".",".","4","1","9",".",".","5"]\n,[".",".",".",".","8",".",".","7","9"]]\n
// @lcpr case=end

 */
